["China will take off the gloves and take strong action if U.S. President-elect Donald Trump continues to provoke Beijing over Taiwan once he assumes office, two leading state-run newspapers said on Monday. In an interview with the Wall Street Journal published on Friday, Trump said the One China policy was up for negotiation. China’s foreign ministry, in response, said One China was the foundation of China-U.S. ties and was non-negotiable. Trump broke with decades of precedent last month by taking a congratulatory telephone call from Taiwan President Tsai Ing-wen, angering Beijing which sees Taiwan as part of China. If Trump is determined to use this gambit in taking office, a period of fierce, damaging interactions will be unavoidable, as Beijing will have no choice but to take off the gloves, the English-language China Daily said. The Global Times, an influential state-run tabloid, echoed the China Daily, saying Beijing would take strong countermeasures against Trump’s attempt to impair the One China principle. The Chinese mainland will be prompted to speed up Taiwan reunification and mercilessly combat those who advocate Taiwan’s independence, the paper said in an editorial. Chinese Foreign Ministry spokeswoman Hua Chunying said the United States was clearly aware of China’s position on One China. U.S. President-elect Donald Trump speaks during a news conference in Trump Tower, Manhattan, New York, U.S., January 11, 2017. REUTERS/Shannon Stapleton Any person should understand that in this world there are certain things that cannot be traded or bought and sold, she told a daily news briefing. The One China principle is the precondition and political basis for any country having relations with China. Hua added, If anyone attempts to damage the One China principle or if they are under the illusion they can use this as a bargaining chip, they will be opposed by the Chinese government and people. In the end it will be like lifting a rock to drop it on one’s own feet, she said, without elaborating. TAIWAN MAY BE SACRIFICED The Global Times said Trump’s endorsement of Taiwan was merely a ploy to further his administration’s short term interests, adding: Taiwan may be sacrificed as a result of this despicable strategy. If you do not beat them until they are bloody and bruised, then they will not retreat, Yang Yizhou, deputy head of China’s government-run All-China Federation of Taiwan Compatriots, told an academic meeting on cross-straits relations in Beijing on Saturday. Also In World News Syrian rebels to attend Kazakhstan peace talks Iran sticks to deadline of nuclear deal with centrifuge move: IAEA Taiwan independence must pay a cost for every step forward taken, we must use bloodstained facts to show them that the road is blocked, Yang said, according to a Monday report on the meeting by the official People’s Daily Overseas Edition. The United States, which switched diplomatic recognition from Taipei to Beijing in 1979, has acknowledged the Chinese position that there is only One China and that Taiwan is part of it. The China Daily said Beijing’s relatively measured response to Trump’s comments in the Wall Street Journal can only come from a genuine, sincere wish that the less-than-desirable, yet by-and-large manageable, big picture of China-U.S. relations will not be derailed before Trump even enters office. But China should not count on the assumption that Trump’s Taiwan moves are a pre-inauguration bluff, and instead be prepared for him to continue backing his bet. It may be costly. But it will prove a worthy price to pay to make the next U.S. president aware of the special sensitivity, and serious consequences of his Taiwan game, said the national daily. (Additional reporting by Ben Blanchard and John Ruwitch; Editing by Michael Perry and Randy Fabi)"]